InformationRegisters/ХранилищеСертификатовПолучателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеСертификатовПолучателей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отпечаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ХранилищеСертификатовПолучателей/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

#Область ВыгрузитьСертификат

&НаКлиенте
Процедура ВыгрузитьСертификат(Команда)
	
	ТекущаяЗапись = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяЗапись <> Неопределено Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные; // ДанныеФормыСтруктура
		ДанныеСертификата = ПолучитьДанныеСертификата(ТекущиеДанные.Отпечаток);
		Если ТекущиеДанные <> Неопределено Тогда
			ИмяФайлаСертификата = ТекущиеДанные.Наименование + ".cer";
		Иначе
			ИмяФайлаСертификата = "Сертификат.cer";
		КонецЕсли;
		
		ОписаниеСледующее = Новый ОписаниеОповещения("ВыгрузитьСертификатЗавершение", ЭтотОбъект);
		МодульСервисКриптографииDSSКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СервисКриптографииDSSКлиент");
		МодульСервисКриптографииDSSКлиент.СохранитьДанныеВФайл(ОписаниеСледующее, ДанныеСертификата, ИмяФайлаСертификата, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьСертификатЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВыполнения.Выполнено Тогда
		Сообщить(РезультатВыполнения.Ошибка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузитьСертификат

&НаКлиенте
Процедура ЗагрузитьСертификат(Команда)
	
	ТекстПодсказки = НСтр("ru = 'Укажите тип хранилища'");
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("AddressBook", "Получатели");
	СписокВыбора.Добавить("ROOT", "Корневые");
	СписокВыбора.Добавить("CA", "Удостоверяющие центры");
	СписокВыбора.Добавить("MY", "Личные");
	
	ОписаниеСледующее = Новый ОписаниеОповещения("ЗагрузитьСертификатПослеВыбораТипаХранилища", ЭтотОбъект);
	ПоказатьВыборИзСписка(ОписаниеСледующее, СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСертификатПослеВыбораТипаХранилища(ТипХранилища, ДополнительныеПараметры) Экспорт
	
	Если ТипХранилища <> Неопределено Тогда
		ПараметрыЦикла = Новый Структура;
		ПараметрыЦикла.Вставить("ТипХранилища", ТипХранилища.Значение);
		ПараметрыЦикла.Вставить("АдресДанных", ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор));
		
		ОписаниеСледующее = Новый ОписаниеОповещения("ЗагрузитьСертификатЗавершение", ЭтотОбъект, ПараметрыЦикла);
		МодульСервисКриптографииDSSКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СервисКриптографииDSSКлиент");
		МодульСервисКриптографииDSSКлиент.ЗагрузитьДанныеИзФайла(ОписаниеСледующее, ".cer", ПараметрыЦикла.АдресДанных, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСертификатЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Выполнено Тогда
		НоваяСтрока = ДополнитьХранилищеСертификатов(ДополнительныеПараметры.АдресДанных, ДополнительныеПараметры.ТипХранилища);
		Если ЗначениеЗаполнено(НоваяСтрока) Тогда
			Элементы.Список.Обновить();
			Элементы.Список.ТекущаяСтрока = НоваяСтрока;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеСертификата(ОтпечатокСертификата)
	
	ДанныеСертификата = КриптографияЭДКО.НайтиСертификатПолучателя(Новый Структура("Отпечаток", ОтпечатокСертификата));
	Возврат ПоместитьВоВременноеХранилище(ДанныеСертификата.Сертификат);
	
КонецФункции

&НаСервереБезКонтекста
Функция ДополнитьХранилищеСертификатов(АдресДанных, ТипХранилища)
	
	Результат = Неопределено;
	
	Идентификатор = КриптографияЭДКО.ДобавитьСертификатПолучателя(АдресДанных, ТипХранилища);
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Результат = РегистрыСведений.ХранилищеСертификатовПолучателей.СоздатьКлючЗаписи(
				Новый Структура("Идентификатор, ТипХранилища", Идентификатор, ТипХранилища));
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
